Stop adding new features.  Work on documenting and stabilizing what is here.
